Reports/20230729_000453/TS-Country/20230729_000458/requests/main/2.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2023-07-28T17:06:46.552Z",
      "request" : {
        "method" : "SOAP",
        "url" : "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Content-Type",
          "value" : "text/xml; charset=utf-8"
        } ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "text/xml; charset=utf-8",
          "text" : "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <web:CountryCurrency>\n         <web:sCountryISOCode>US</web:sCountryISOCode>\n      </web:CountryCurrency>\n   </soapenv:Body>\n</soapenv:Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Cache-Control",
          "value" : "private, max-age=0"
        }, {
          "name" : "Server",
          "value" : "Microsoft-IIS/8.5"
        }, {
          "name" : "Vary",
          "value" : "Accept-Encoding"
        }, {
          "name" : "Web-Service",
          "value" : "DataFlex 19.1"
        }, {
          "name" : "#status#",
          "value" : "HTTP/1.1 200 OK"
        }, {
          "name" : "Date",
          "value" : "Fri, 28 Jul 2023 17:06:45 GMT"
        }, {
          "name" : "Content-Type",
          "value" : "text/xml; charset=utf-8"
        } ],
        "content" : {
          "size" : 425,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <m:CountryCurrencyResponse xmlns:m=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <m:CountryCurrencyResult>\r\n        <m:sISOCode>USD</m:sISOCode>\r\n        <m:sName>Dollars</m:sName>\r\n      </m:CountryCurrencyResult>\r\n    </m:CountryCurrencyResponse>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 165,
        "bodySize" : -1,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "blocked" : -1,
        "dns" : -1,
        "send" : 0,
        "wait" : 0,
        "receive" : 0,
        "connect" : 0
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "2",
        "testObjectId" : "Object Repository/API Latihan/SOAP/SOAP Service (1)/CountryInfoServiceSoapBinding/CountryCurrency",
        "harId" : "59e36b62-5efb-4628-9c17-08ac626cd734",
        "reportFolder" : null
      },
      "time" : 0
    } ],
    "comment" : ""
  }
}